/*
 * timer.c
 *
 *  Created on: 2022年7月13日
 *      Author: FeiDao
 */
#include <timer.h>

//-------------------------------------------------------------------------------------------------------------------
//  @brief      定时器中断初始化
//  @param      timer_name      定时器名称
//  @param      peri_s         中断执行周期ms
//  @return     void
//  @note       中断周期会影响其他相同定时器的引脚功能
//-------------------------------------------------------------------------------------------------------------------


void timer_init(unsigned int timer_name, long peri_ms)
{
    if (timer_name == 10)//A0
    {
        TA0CCTL0|=CCIE;
        TA0CCR0|=peri_ms*33;
        TA0CTL = TASSEL_1 + MC_1 + TACLR;
    }
    if (timer_name == 11)//A1
    {
        TA1CCTL0|=CCIE;
        TA1CCR0|=peri_ms*33;
        TA1CTL = TASSEL_1 + MC_1 + TACLR;
    }
    if (timer_name == 12)//A2
    {
        TA2CCTL0|=CCIE;
        TA2CCR0|=peri_ms*33;
        TA2CTL = TASSEL_1 + MC_1 + TACLR;
    }
    if (timer_name == 20)//B0
    {
        TB0CCTL0|=CCIE;
        TB0CCR0|=peri_ms*33;
        TB0CTL = TBSSEL_1 + MC_1 + TBCLR;
    }
}



//-------------------------------------------------------------------------------------------------------------------
//  @brief      定时器中断TA0
//  @return     void
//  @note       中断内的内容会影响中断执行速度
//-------------------------------------------------------------------------------------------------------------------
#pragma vector=TIMER0_A0_VECTOR
__interrupt void TIMER0_A0(void)
{
    //中断执行内容---------------------------------------------------------------------------------------------------
//    P1OUT ^= BIT0;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      定时器中断TA1
//  @return     void
//  @note
//-------------------------------------------------------------------------------------------------------------------
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TIMER1_A0(void)
{
    //中断执行内容---------------------------------------------------------------------------------------------------
//    P1OUT ^= BIT0;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      定时器中断TA2
//  @return     void
//  @note
//-------------------------------------------------------------------------------------------------------------------
#pragma vector=TIMER2_A0_VECTOR
__interrupt void TIMER2_A0(void)
{
    //中断执行内容---------------------------------------------------------------------------------------------------

}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      定时器中断TB0
//  @return     void
//  @note
//-------------------------------------------------------------------------------------------------------------------
#pragma vector=TIMER0_B0_VECTOR
__interrupt void TIMER0_B0(void)
{
    //中断执行内容---------------------------------------------------------------------------------------------------
    P1OUT ^= BIT0;

    if(edit_complete_flag==1) // start run
    {
        speed_1 = encoder_count2;
        speed_2 = encoder_count1;

//        pwm_duty(14,40);
//        pwm_duty(15,50);

        PID_realize(speed_2,speed_1);

        encoder_count2 = 0;
        encoder_count1 = 0;

        ground_sensor_get();
        track_line();
        
        motor_realise();
    }
}

